In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
Names = pd.Series(['Ali','Mohammed','Ahmad'],index=[1,2,3])
Names

1         Ali
2    Mohammed
3       Ahmad
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
Names.index=[11,12,13]
Names

11         Ali
12    Mohammed
13       Ahmad
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
Names[0:2]

11         Ali
12    Mohammed
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
Names[14]='Mohammed'
Names

11         Ali
12    Mohammed
13       Ahmad
14    Mohammed
dtype: object

In [6]:
Names.drop_duplicates(inplace=True)
Names

11         Ali
12    Mohammed
13       Ahmad
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [7]:
 Students = {'ID':[Names.index[0],Names.index[1],Names.index[2]],
             'Name':[Names.iloc[0],Names.iloc[1],Names.iloc[2]],
             'GPA':[4.63,4.51,4.52]}
df = pd.DataFrame(Students)
df

   ID      Name   GPA
0  11       Ali  4.63
1  12  Mohammed  4.51
2  13     Ahmad  4.52

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [9]:
educ = pd.read_csv('educ_figdp_1_Data.csv')
educ.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [10]:
educ.loc[0:5,['TIME','GEO']]

   TIME                            GEO
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)
4  2004  European Union (28 countries)
5  2005  European Union (28 countries)

In [11]:
educ[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [12]:
df

   ID      Name   GPA
0  11       Ali  4.63
1  12  Mohammed  4.51
2  13     Ahmad  4.52

In [13]:
df.index=[11,22,33]
df

    ID      Name   GPA
11  11       Ali  4.63
22  12  Mohammed  4.51
33  13     Ahmad  4.52

In [14]:
df.loc[0:2]

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

In [15]:
df.loc[11:33]

    ID      Name   GPA
11  11       Ali  4.63
22  12  Mohammed  4.51
33  13     Ahmad  4.52

In [16]:
df[0:3]

    ID      Name   GPA
11  11       Ali  4.63
22  12  Mohammed  4.51
33  13     Ahmad  4.52

In [17]:
df[11:33]

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []